backend/app/models/move.rb

  def identify_winner
    if Board::WINNING_COMBINATIONS.select { |comb| comb.include?(cell) }.any? do |comb|
         board.moves.where(cell: comb, player: player).count.eql?(3)
       end
      board.update!(winner: player)
---
SELECT COUNT(*) FROM "moves" WHERE "moves"."board_id" = $1 AND "moves"."cell" IN ($2, $3, $4) AND "moves"."player_id" = $5  [["board_id", 18], ["cell", 3], ["cell", 4], ["cell", 5], ["player_id", 1]]
UPDATE "boards" SET "winner_id" = $1, "updated_at" = $2 WHERE "boards"."id" = $3  [["winner_id", 1], ["updated_at", "2022-02-27 23:10:17.949609"], ["id", 18]]