backend/app/controllers/api/v1/boards_controller.rb

      def create
        ActiveRecord::Base.transaction do
          set_players
          board = Board.create!(player1: @player1, player2: @player2)
---
INSERT INTO "players" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "p1"], ["created_at", "2022-02-27 19:39:05.570240"], ["updated_at", "2022-02-27 19:39:05.570240"]]
INSERT INTO "boards" ("player1_id", "player2_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["player1_id", 1], ["player2_id", 2], ["created_at", "2022-02-27 21:37:44.131469"], ["updated_at", "2022-02-27 21:37:44.131469"]]

      def set_players
        @player1 = Player.find_or_create_by(name: params[:player1])
        @player2 = Player.find_or_create_by(name: params[:player2])
---
SELECT "players".* FROM "players" WHERE "players"."name" = $1 LIMIT $2  [["name", "p1"], ["LIMIT", 1]]
INSERT INTO "players" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "p1"], ["created_at", "2022-02-27 21:32:40.750009"], ["updated_at", "2022-02-27 21:32:40.750009"]]
SELECT "players".* FROM "players" WHERE "players"."name" = $1 LIMIT $2  [["name", "p2"], ["LIMIT", 1]]