backend/app/controllers/api/v1/moves_controller.rb

  def create
    @move = @board.moves.new(move_params)
    if @move.save
---
INSERT INTO "moves" ("player_id", "board_id", "cell", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["player_id", 1], ["board_id", 18], ["cell", 0], ["created_at", "2022-02-27 23:10:14.878419"], ["updated_at", "2022-02-27 23:10:14.878419"]]

  def set_board
    @board = Board.find(params[:board_id])
---
SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]