backend/app/controllers/api/v1/players_controller.rb

      def index
        render json: Player.all
---
SELECT "players".* FROM "players"